#### 🛠 Terraform Plan Result

<details><summary>Click to expand</summary>

```hcl
aws_acm_certificate.site_cert: Refreshing state... [id=arn:aws:acm:us-east-1:975050005697:certificate/9059c107-8505-42b2-92af-3e7c13b838e3]
cloudflare_dns_record.cert_validation["crimsonherb.me"]: Refreshing state... [id=13aa20b635c2e086a2fdc12e465d3177]
aws_cloudfront_origin_access_control.oac: Refreshing state... [id=E3NB910QFOKXZT]
aws_s3_bucket.site: Refreshing state... [id=crimsonherb.me]
aws_s3_bucket_public_access_block.site_block: Refreshing state... [id=crimsonherb.me]
aws_s3_bucket_versioning.site_versioning: Refreshing state... [id=crimsonherb.me]
aws_s3_bucket_ownership_controls.site_ownership_control: Refreshing state... [id=crimsonherb.me]
aws_cloudfront_distribution.s3_distribution: Refreshing state... [id=E2EHDV0XZ0MEHJ]
aws_s3_bucket_policy.site_policy: Refreshing state... [id=crimsonherb.me]
cloudflare_dns_record.site_cname: Refreshing state... [id=5c3b0ce7ccb537e93271a8645da9f6bd]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # cloudflare_dns_record.cert_validation["crimsonherb.me"] will be updated in-place
  ~ resource "cloudflare_dns_record" "cert_validation" {
      ~ comment_modified_on = "2025-07-28T15:30:30Z" -> (known after apply)
      ~ content             = "_b10011f81f6f43339c34c92b777b179f.xlfgrmvvlj.acm-validations.aws" -> "_b10011f81f6f43339c34c92b777b179f.xlfgrmvvlj.acm-validations.aws."
      ~ created_on          = "2025-07-28T15:30:30Z" -> (known after apply)
        id                  = "13aa20b635c2e086a2fdc12e465d3177"
      ~ meta                = jsonencode({}) -> (known after apply)
      ~ modified_on         = "2025-07-28T16:25:32Z" -> (known after apply)
      ~ name                = "_88ce75a706ad8e25c3d7c550e227e402.crimsonherb.me" -> "_88ce75a706ad8e25c3d7c550e227e402.crimsonherb.me."
      ~ proxiable           = false -> (known after apply)
      ~ settings            = {
          ~ flatten_cname = false -> (known after apply)
          + ipv4_only     = false
          + ipv6_only     = false
        }
      ~ tags                = [] -> (known after apply)
      + tags_modified_on    = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # cloudflare_dns_record.site_cname will be updated in-place
  ~ resource "cloudflare_dns_record" "site_cname" {
      ~ comment_modified_on = "2025-07-16T14:22:26Z" -> (known after apply)
      ~ created_on          = "2025-07-16T14:22:26Z" -> (known after apply)
        id                  = "5c3b0ce7ccb537e93271a8645da9f6bd"
      ~ meta                = jsonencode({}) -> (known after apply)
      ~ modified_on         = "2025-07-16T14:22:26Z" -> (known after apply)
        name                = "crimsonherb.me"
      ~ proxiable           = true -> (known after apply)
      ~ proxied             = true -> false
      ~ settings            = {
          ~ flatten_cname = false -> (known after apply)
          + ipv4_only     = (known after apply)
          + ipv6_only     = (known after apply)
        } -> (known after apply)
      ~ tags                = [] -> (known after apply)
      + tags_modified_on    = (known after apply)
        # (5 unchanged attributes hidden)
    }

Plan: 0 to add, 2 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Triggered by @crimsonherb on PR #21*